
/* ============================================ *
 *  Алгоритм SelectionSort (Сортировка выбором) *
 * ============================================ */

let count = 0

/* ======================================== *
 *                 Пример 1                 *
 * ======================================== */

/**
 * Реализация сортировка выбором
 * @param {Array} array - список
 */
function selectionSort(array) {

  // проходим весь массив столько раз, сколько в нём элементов
  for (let i = 0; i < array.length; i++) {
    // индекс минимального элемента в массиве
    let indexMin = i

    // в рамках каждого прохода нам тоже нужно просматривать на один элемент меньше
    for (let j = i+1; j < array.length; j++) {
      // если элемент в итерации меньше минимального, обновляем минимальное
      if (array[j] < array[indexMin]) {
        indexMin = j
      }

      count += 1
    }

    // ... меняем местами элемент в итерации с минимальным элементом в массиве
    [array[i], array[indexMin]] = [array[indexMin], array[i]];
  }

  return array
}

console.log(selectionSort([56, 87, 18, 92, 42, 31, 44, 82, 36, 91, 56, 87, 18, 92, 42, 31, 44, 82, 36, 91, 56, 87, 18, 92, 42, 31, 44, 82, 36, 91, 56, 87, 18, 92, 42, 31, 44, 82, 36, 91]))

console.log(`Количество итераций: ` + count)